CongducPham/PEPR_AgriFutur/Arduino_ESP32/Arduino_ESP32_CAM_CameraWebServer_3_1_1/Arduino_ESP32_CAM_CameraWebServer_3_1_1.ino
/*
 *  LoRaCAM takes picture, encode and send image with LoRa
 *
 *  Copyright (C) 2025 Congduc Pham
 *
 *  This program is free software: you can redistribute it and/or modify
 *  it under the terms of the GNU General Public License as published by
 *  the Free Software Foundation, either version 3 of the License, or
 *  (at your option) any later version.
 *
 *  This program is distributed in the hope that it will be useful,
 *  but WITHOUT ANY WARRANTY; without even the implied warranty of
 *  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 *  GNU General Public License for more details.
 *
 *  You should have received a copy of the GNU General Public License
 *  along with the program.  If not, see <http://www.gnu.org/licenses/>.
 *
 *****************************************************************************
 *
 *  Version:                1.0
 #  Based on ESP32 CameraWebServer and Arduino_LoRa_ucamII (https://cpham.perso.univ-pau.fr/WSN-MODEL/tool-html/imagesensor.html)
 *  Design:                 C. Pham
 *  Implementation:         C. Pham
 *  Last update:            Jan. 29th, 2025
 *
 *  TODO: there is no real LoRa transmission yet
 *
 *  With #define WAIT_FOR_SERIAL_INPUT, for testing purposes, no deep sleep, a command starts with /@ and ends with #: /@Z40#Q40#
 *    "Z64#" -> sets the MSS size to 64, default is 90 for LoRa
 *    "Q15#" -> sets the quality factor to 15, default is 20 for LoRa
 *    "F30000#" -> sets inter-capture time to 30000ms, i.e. 30s, fps is then 1/30, default is 60000ms, i.e. 60s
 *
 *  Otherwise (should be considered as default setting)
 *    - periodic capture & transmission every hour
 *    - deep sleep between capture, similar to full reset
 *    - to flash a new code, connect board and upload before device goes in deep sleep.
 *      A 30s window is set for such purpose before the first deep sleep period
 */

#include "esp_camera.h"
#include "esp_timer.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include <WiFi.h>

//#define ORIGINAL_CONFIG

#ifdef ORIGINAL_CONFIG
    #define WITH_WEB_SERVER
#else
    #define TEST_IN_PROGRESS
    //#define WITH_WEB_SERVER
    #define WITH_CUSTOM_CAM
    #define WITH_LORA_MODULE
    //#define WAIT_FOR_SERIAL_INPUT
    #define LOW_POWER // incompatible with WITH_WEB_SERVER and WAIT_FOR_SERIAL_INPUT
    #define LOW_POWER_DEEP_SLEEP
    //LOW_POWER_LIGHT_SLEEP not tested yet
    //#define LOW_POWER_LIGHT_SLEEP        
#endif

// if the XIAO_ESP32S3_SENSE is not automatically detected
#define MY_XIAO_ESP32S3_SENSE
// if the FREENOVE_ESP32S3_CAM is not automatically detected
//#define MY_FREENOVE_ESP32S3_CAM
// if the FREENOVE_ESP32_CAM_DEV is not automatically detected, board v1.6
//#define MY_FREENOVE_ESP32_CAM_DEV
// if the NONAME_ESP32_CAM_DEV is not automatically detected, similar to FREENOVE_ESP32_CAM_DEV
//#define MY_NONAME_ESP32_CAM_DEV

////////////////////////////////////////////////////////////////////
// CameraWebServer example

// ===================
// Select camera model
// ===================
// --> CAMERA_MODEL_WROVER_KIT: Freenove ESP32 WROVER DEV Board v1.6 & v3.0
//#define CAMERA_MODEL_WROVER_KIT // Has PSRAM
//#define CAMERA_MODEL_ESP_EYE  // Has PSRAM
// --> CAMERA_MODEL_ESP32S3_EYE: Freenove ESP32S3 WROOM Board
//#define CAMERA_MODEL_ESP32S3_EYE // Has PSRAM
//#define CAMERA_MODEL_M5STACK_PSRAM // Has PSRAM
//#define CAMERA_MODEL_M5STACK_V2_PSRAM // M5Camera version B Has PSRAM
//#define CAMERA_MODEL_M5STACK_WIDE // Has PSRAM
//#define CAMERA_MODEL_M5STACK_ESP32CAM // No PSRAM
//#define CAMERA_MODEL_M5STACK_UNITCAM // No PSRAM
//#define CAMERA_MODEL_M5STACK_CAMS3_UNIT  // Has PSRAM
// --> CAMERA_MODEL_AI_THINKER: ESP32-CAM board
//#define CAMERA_MODEL_AI_THINKER // Has PSRAM
//#define CAMERA_MODEL_TTGO_T_JOURNAL // No PSRAM
// --> CAMERA_MODEL_XIAO_ESP32S3: XIAO ESP32S3 Sense
#define CAMERA_MODEL_XIAO_ESP32S3 // Has PSRAM
// ** Espressif Internal Boards **
//#define CAMERA_MODEL_ESP32_CAM_BOARD
//#define CAMERA_MODEL_ESP32S2_CAM_BOARD
//#define CAMERA_MODEL_ESP32S3_CAM_LCD
//#define CAMERA_MODEL_DFRobot_FireBeetle2_ESP32S3 // Has PSRAM
//#define CAMERA_MODEL_DFRobot_Romeo_ESP32S3 // Has PSRAM
#include "camera_pins.h"

// ===========================
// Enter your WiFi credentials
// ===========================
const char *ssid = "freebox_TYWCSM";   
const char *password = "copernic";

//const char *ssid = "iPhoneD";   
//const char *password = "345hello";

//app_httpd.cpp
void startCameraServer();
void setupLedFlash(int pin);

////////////////////////////////////////////////////////////////////
// LoRa + custom cam with optimized image encoding

////////////////////////////////////////////////////////////////////
#define BOOT_START_MSG  "\nNewGen LoRaCAM Sensor – Jan. 29th, 2025. C. Pham, UPPA, France\n"

#ifdef WITH_CUSTOM_CAM
#include "custom_cam.h"
#endif

#ifdef WITH_LORA_MODULE
#include "RadioSettings.h"

////////////////////////////////////////////////////////////////////
// Frequency band - do not change in SX12XX_RadioSettings.h anymore
// if using a native LoRaWAN module such as RAK3172, also select band in RadioSettings.h
#define EU868
// #define AU915
// #define EU433
// #define AS923_2

#ifdef WITH_SPI_COMMANDS
  #include <SPI.h>
  // this is the standard behaviour of library, use SPI Transaction switching
  #define USE_SPI_TRANSACTION
#endif

#ifdef SX126X
  #include <SX126XLT.h>
  #include "SX126X_RadioSettings.h"
#endif

#ifdef SX127X
  #include <SX127XLT.h>
  #include "SX127X_RadioSettings.h"
#endif

#ifdef SX128X
  #include <SX128XLT.h>
  #include "SX128X_RadioSettings.h"
#endif       

///////////////////////////////////////////////////////////////////
// ENCRYPTION CONFIGURATION AND KEYS FOR LORAWAN
#if defined LORAWAN && defined CUSTOM_LORAWAN
  #ifndef WITH_AES
    #define WITH_AES
  #endif
#endif
#ifdef WITH_AES
  #include "local_lorawan.h"
#endif

// create a library class instance called LT
// to handle LoRa radio communications

#ifdef SX126X
SX126XLT LT;
#endif

#ifdef SX127X
SX127XLT LT;
#endif

#ifdef SX128X
SX128XLT LT;
#endif

// keep track of the number of successful transmissions
uint32_t TXPacketCount=0;
#endif //WITH_LORA_MODULE

#if defined LOW_POWER_DEEP_SLEEP || defined LOW_POWER_LIGHT_SLEEP

#define mS_TO_uS_FACTOR 1000ULL /* Conversion factor for milli seconds to micro seconds */
RTC_DATA_ATTR int bootCount = 0;

void print_wakeup_reason() {
    esp_sleep_wakeup_cause_t wakeup_reason;

