CongducPham/PEPR_AgriFutur/Arduino_ESP32/Arduino_ESP32_CAM_CameraWebServer_3_1_1/Arduino_ESP32_CAM_CameraWebServer_3_1_1.ino
    wakeup_reason = esp_sleep_get_wakeup_cause();

    switch (wakeup_reason) {
        case ESP_SLEEP_WAKEUP_EXT0:
            Serial.println("Wakeup caused by external signal using RTC_IO");
            break;
        case ESP_SLEEP_WAKEUP_EXT1:
            Serial.println("Wakeup caused by external signal using RTC_CNTL");
            break;
        case ESP_SLEEP_WAKEUP_TIMER:
            Serial.println("Wakeup caused by timer");
            break;
        case ESP_SLEEP_WAKEUP_TOUCHPAD:
            Serial.println("Wakeup caused by touchpad");
            break;
        case ESP_SLEEP_WAKEUP_ULP:
            Serial.println("Wakeup caused by ULP program");
            break;
        default:
            Serial.printf("Wakeup was not caused by deep sleep: %d\n", wakeup_reason);
            break;
    }
}

void lowPower(unsigned long time_ms) {
    ++bootCount;
    Serial.println("Boot number: " + String(bootCount));

    // Print the wakeup reason for ESP32
    print_wakeup_reason();
    esp_sleep_enable_timer_wakeup(time_ms * mS_TO_uS_FACTOR);  // set wake up source
    //Serial.println("Setup ESP32 to sleep for every " + String(idlePeriodInMin) + " minutes and " +
    //               String(idlePeriodInSec) + " Seconds");
    Serial.println("Going to deep sleep now");
    Serial.flush();
#ifdef LOW_POWER_DEEP_SLEEP
    esp_deep_sleep_start();
#endif
#ifdef LOW_POWER_LIGHT_SLEEP
    esp_light_sleep_start();
#endif
}
#endif //defined LOW_POWER_DEEP_SLEEP || defined LOW_POWER_LIGHT_SLEEP

/*****************************
 _____      _               
/  ___|    | |              
\ `--.  ___| |_ _   _ _ __  
 `--. \/ _ \ __| | | | '_ \ 
/\__/ /  __/ |_| |_| | |_) |
\____/ \___|\__|\__,_| .__/ 
                     | |    
                     |_|    
******************************/

void setup() {
    Serial.begin(115200);
    //while (!Serial);  // Ensure that the serial port is enabled
    // Serial.setDebugOutput(true);
    Serial.println();

#ifdef ESP32
    Serial.print("ESP32 detected\n");
#endif
#if defined ESP32S3_DEV || defined MY_FREENOVE_ESP32S3_CAM
    Serial.print("FREENOVE_ESP32S3_CAM variant (test)\n");
#endif
#if defined MY_FREENOVE_ESP32_CAM_DEV || defined MY_NONAME_ESP32_CAM_DEV
    Serial.print("ESP32_CAM_DEV variant\n");
#endif
#if defined MY_XIAO_ESP32S3_SENSE
    Serial.print("XIAO-ESP32S3-Sense variant with camera board\n");
#endif

#ifdef WITH_LORA_MODULE
#if defined MY_XIAO_ESP32S3 || defined MY_XIAO_ESP32S3_SENSE
    pinMode(2, OUTPUT);  // GPIO 2 = D1
    pinMode(1, OUTPUT);  // GPIO 1 = D0
    pinMode(4, INPUT);   // GPIO 4 = D3
    pinMode(5, OUTPUT);  // GPIO 5 = D4
    delay(10);
    Serial.print("Setting SPI pins for XIAO-ESP32S3-Sense\n");
    //        SCK, MISO, MOSI, CS/SS
    SPI.begin(1, 4, 5, 2);
#elif defined MY_FREENOVE_ESP32S3_CAM
    pinMode(21, OUTPUT);  // GPIO 21 = 21
    pinMode(47, OUTPUT);  // GPIO 47 = 47
    pinMode(42, INPUT);   // GPIO 42 = 42
    pinMode(41, OUTPUT);  // GPIO 41 = 41
    delay(10);
    Serial.print("Setting SPI pins for FREENOVE-ESP32S3-CAM\n");
    //        SCK, MISO,  MOSI, CS/SS
    SPI.begin(47, 42, 41, 21);
#elif MY_FREENOVE_ESP32_CAM_DEV || defined MY_NONAME_ESP32_CAM_DEV
    pinMode(32, OUTPUT);
    pinMode(12, OUTPUT);
    pinMode(13, INPUT);
    pinMode(14, OUTPUT);
    delay(10);
    //        SCK, MISO,  MOSI, CS/SS
    SPI.begin(12, 13, 14, 32);
#else
    // start SPI bus communication
    SPI.begin();
#endif

    // setup hardware pins used by device, then check if device is found
#ifdef SX126X
    if (LT.begin(NSS, NRESET, RFBUSY, DIO1, DIO2, DIO3, RX_EN, TX_EN, SW, LORA_DEVICE))
#endif

#ifdef SX127X
    if (LT.begin(NSS, NRESET, DIO0, DIO1, DIO2, LORA_DEVICE))
#endif

#ifdef SX128X
    if (LT.begin(NSS, NRESET, RFBUSY, DIO1, DIO2, DIO3, RX_EN, TX_EN, LORA_DEVICE))
#endif
        {
            Serial.print("LoRa Device found\n");
            delay(1000);
        } else {
            Serial.print("No device responding\n");
            while (1) {
            }
        }

    /*******************************************************************************************************
      Based from SX12XX example - Stuart Robinson
    *******************************************************************************************************/

    // The function call list below shows the complete setup for the LoRa device using the
    //  information defined in the Settings.h file.
    // The 'Setup LoRa device' list below can be replaced with a single function call;
    // LT.setupLoRa(Frequency, Offset, SpreadingFactor, Bandwidth, CodeRate, Optimisation);

    //***************************************************************************************************
    // Setup LoRa device
    //***************************************************************************************************
    // got to standby mode to configure device
    LT.setMode(MODE_STDBY_RC);
#ifdef SX126X
    LT.setRegulatorMode(USE_DCDC);
    LT.setPaConfig(0x04, PAAUTO, LORA_DEVICE);
    LT.setDIO3AsTCXOCtrl(TCXO_CTRL_3_3V);
    LT.calibrateDevice(ALLDevices);  // is required after setting TCXO
    LT.calibrateImage(DEFAULT_CHANNEL);
    LT.setDIO2AsRfSwitchCtrl();
#endif
#ifdef SX128X
    LT.setRegulatorMode(USE_LDO);
#endif
    // set for LoRa transmissions
    LT.setPacketType(PACKET_TYPE_LORA);
    // set the operating frequency
#ifdef MY_FREQUENCY
    LT.setRfFrequency(MY_FREQUENCY, Offset);
#else
    LT.setRfFrequency(DEFAULT_CHANNEL, Offset);
#endif
// run calibration after setting frequency
#ifdef SX127X
    LT.calibrateImage(0);
#endif
    // set LoRa modem parameters
#if defined SX126X || defined SX127X
    LT.setModulationParams(SpreadingFactor, Bandwidth, CodeRate, Optimisation);
#endif
#ifdef SX128X
    LT.setModulationParams(SpreadingFactor, Bandwidth, CodeRate);
#endif
    // where in the SX buffer packets start, TX and RX
    LT.setBufferBaseAddress(0x00, 0x00);
    // set packet parameters
#if defined SX126X || defined SX127X
    LT.setPacketParams(8, LORA_PACKET_VARIABLE_LENGTH, 255, LORA_CRC_ON, LORA_IQ_NORMAL);
#endif
#ifdef SX128X
    LT.setPacketParams(12, LORA_PACKET_VARIABLE_LENGTH, 255, LORA_CRC_ON, LORA_IQ_NORMAL, 0, 0);
#endif
    // syncword, LORA_MAC_PRIVATE_SYNCWORD = 0x12, or LORA_MAC_PUBLIC_SYNCWORD = 0x34
#if defined SX126X || defined SX127X
#if defined PUBLIC_SYNCWORD || defined LORAWAN
    LT.setSyncWord(LORA_MAC_PUBLIC_SYNCWORD);
#else
    LT.setSyncWord(LORA_MAC_PRIVATE_SYNCWORD);
#endif
    // set for highest sensitivity at expense of slightly higher LNA current
    LT.setHighSensitivity();  // set for maximum gain
#endif
#ifdef SX126X
    // set for IRQ on TX done and timeout on DIO1
    LT.setDioIrqParams(IRQ_RADIO_ALL, (IRQ_TX_DONE + IRQ_RX_TX_TIMEOUT), 0, 0);
#endif
#ifdef SX127X
    // set for IRQ on RX done
    LT.setDioIrqParams(IRQ_RADIO_ALL, IRQ_TX_DONE, 0, 0);
    LT.setPA_BOOST(PA_BOOST);
#endif
#ifdef SX128X
    LT.setDioIrqParams(IRQ_RADIO_ALL, (IRQ_TX_DONE + IRQ_RX_TX_TIMEOUT), 0, 0);
#endif

