CongducPham/PEPR_AgriFutur/Arduino_ESP32/Arduino_ESP32_CAM_CameraWebServer_3_1_1/Arduino_ESP32_CAM_CameraWebServer_3_1_1.ino
    if (IQ_Setting == LORA_IQ_INVERTED) {
        LT.invertIQ(true);
        Serial.print("Invert I/Q on RX\n");
    } else {
        LT.invertIQ(false);
        Serial.print("Normal I/Q\n");
    }

    //***************************************************************************************************

    Serial.println();
    // reads and prints the configured LoRa settings, useful check
    LT.printModemSettings();
    Serial.println();
    // reads and prints the configured operating settings, useful check
    LT.printOperatingSettings();
    Serial.println();
    Serial.println();
#if defined SX126X || defined SX127X
    // print contents of device registers, normally 0x00 to 0x4F
    LT.printRegisters(0x00, 0x4F);
#endif
#ifdef SX128X
    // print contents of device registers, normally 0x900 to 0x9FF
    LT.printRegisters(0x900, 0x9FF);
#endif

    /*******************************************************************************************************
      End from SX12XX example - Stuart Robinson
    *******************************************************************************************************/

#ifdef SX126X
    Serial.print("SX126X");
#endif
#ifdef SX127X
    Serial.print("SX127X");
#endif
#ifdef SX128X
    Serial.print("SX128X");
#endif

    // Print a success message
    Serial.print(" successfully configured\n");
#endif  //WITH_LORA_MODULE

    camera_config_t config;
    config.ledc_channel = LEDC_CHANNEL_0;
    config.ledc_timer = LEDC_TIMER_0;
    config.pin_d0 = Y2_GPIO_NUM;
    config.pin_d1 = Y3_GPIO_NUM;
    config.pin_d2 = Y4_GPIO_NUM;
    config.pin_d3 = Y5_GPIO_NUM;
    config.pin_d4 = Y6_GPIO_NUM;
    config.pin_d5 = Y7_GPIO_NUM;
    config.pin_d6 = Y8_GPIO_NUM;
    config.pin_d7 = Y9_GPIO_NUM;
    config.pin_xclk = XCLK_GPIO_NUM;
    config.pin_pclk = PCLK_GPIO_NUM;
    config.pin_vsync = VSYNC_GPIO_NUM;
    config.pin_href = HREF_GPIO_NUM;
    config.pin_sccb_sda = SIOD_GPIO_NUM;
    config.pin_sccb_scl = SIOC_GPIO_NUM;
    config.pin_pwdn = PWDN_GPIO_NUM;
    config.pin_reset = RESET_GPIO_NUM;
#ifdef ORIGINAL_CONFIG
    config.xclk_freq_hz = 20000000;
#else
    // C.PHAM – Jan. 20th, 2025
    config.xclk_freq_hz = 10000000;
#endif
    config.frame_size = FRAMESIZE_UXGA;
#ifdef ORIGINAL_CONFIG
    config.pixel_format = PIXFORMAT_JPEG;  // for streaming
#else
    // C.PHAM – Jan. 20th, 2025
    config.pixel_format = PIXFORMAT_GRAYSCALE;  // for getting BMP
#endif
    // config.pixel_format = PIXFORMAT_RGB565; // for face detection/recognition
#ifdef ORIGINAL_CONFIG
    config.grab_mode = CAMERA_GRAB_WHEN_EMPTY;
#else
    // C.PHAM – Jan. 20th, 2025
    config.grab_mode = CAMERA_GRAB_LATEST;
#endif
    config.fb_location = CAMERA_FB_IN_PSRAM;
    config.jpeg_quality = 12;
    config.fb_count = 1;

    // if PSRAM IC present, init with UXGA resolution and higher JPEG quality
    //                      for larger pre-allocated frame buffer.
    if (config.pixel_format == PIXFORMAT_JPEG) {
        if (psramFound()) {
            config.jpeg_quality = 10;
            config.fb_count = 2;
            config.grab_mode = CAMERA_GRAB_LATEST;
        } else {
            // Limit the frame size when PSRAM is not available
            config.frame_size = FRAMESIZE_SVGA;
            config.fb_location = CAMERA_FB_IN_DRAM;
        }
    } else {
        // Best option for face detection/recognition
#if defined ORIGINAL_CONFIG || defined CAM_RES240X240
        config.frame_size = FRAMESIZE_240X240;
#else
        config.frame_size = FRAMESIZE_128X128;
#endif

#if CONFIG_IDF_TARGET_ESP32S3
        config.fb_count = 2;
#endif
    }

#if defined(CAMERA_MODEL_ESP_EYE)
    pinMode(13, INPUT_PULLUP);
    pinMode(14, INPUT_PULLUP);
#endif

    // camera init
    esp_err_t err = esp_camera_init(&config);
    if (err != ESP_OK) {
        Serial.printf("Camera init failed with error 0x%x", err);
        return;
    }

    sensor_t *s = esp_camera_sensor_get();
    // initial sensors are flipped vertically and colors are a bit saturated
    if (s->id.PID == OV3660_PID) {
        s->set_vflip(s, 1);        // flip it back
        s->set_brightness(s, 1);   // up the brightness just a bit
        s->set_saturation(s, -2);  // lower the saturation
    }
    // drop down frame size for higher initial frame rate
    if (config.pixel_format == PIXFORMAT_JPEG) {
        s->set_framesize(s, FRAMESIZE_QVGA);
    }

#if defined(CAMERA_MODEL_M5STACK_WIDE) || defined(CAMERA_MODEL_M5STACK_ESP32CAM)
    s->set_vflip(s, 1);
    s->set_hmirror(s, 1);
#endif

#if defined(CAMERA_MODEL_ESP32S3_EYE)
    s->set_vflip(s, 1);
#endif

// Setup LED FLash if LED pin is defined in camera_pins.h
#if defined(LED_GPIO_NUM)
    setupLedFlash(LED_GPIO_NUM);
#endif

    // Print a start message
    Serial.println(BOOT_START_MSG);

#if defined(WITH_WEB_SERVER)
    WiFi.begin(ssid, password);
    WiFi.setSleep(false);

    Serial.print("WiFi connecting");
    while (WiFi.status() != WL_CONNECTED) {
        delay(500);
        Serial.print(".");
    }
    Serial.println("");
    Serial.println("WiFi connected");

    startCameraServer();

    Serial.print("Camera Ready! Use 'http://");
    Serial.print(WiFi.localIP());
    Serial.println("' to connect");
#endif

#if defined(WITH_CUSTOM_CAM)
    init_custom_cam();
#endif

    pinMode(LED_BUILTIN, OUTPUT);
}

#ifdef WAIT_FOR_SERIAL_INPUT

// BEWARE, we limit the size of the received cmd to avoid strange packets arriving. 
// So avoid to have to long cmd, use multiple cmd is necessary
#define MAX_CMD_LENGTH           60

uint8_t* rcv_data = NULL;
uint8_t rcv_data_len=0;

long getCmdValue(int &i, char* strBuff=NULL) {
      
      // a maximum of 16 characters plus the null-terminited character, can store a 64-bit MAC address
      char seqStr[17]="****************";

      int j=0;
      // character '#' will indicate end of cmd value
      while ((char)rcv_data[i]!='#' && (i < rcv_data_len) && j<strlen(seqStr)) {
              seqStr[j]=(char)rcv_data[i];
              i++;
              j++;
      }
      
      // put the null character at the end
      seqStr[j]='\0';
      
      if (strBuff) {
              strcpy(strBuff, seqStr);        
      }
      else
              return (atol(seqStr));
}   
#endif //WAIT_FOR_SERIAL_INPUT

