CongducPham/PEPR_AgriFutur/Arduino_ESP32/Arduino_ESP32_CAM_CameraWebServer_3_1_1/Arduino_ESP32_CAM_CameraWebServer_3_1_1.ino
/*****************************
  _                      
 | |    ___   ___  _ __  
 | |   / _ \ / _ \| '_ \ 
 | |__| (_) | (_) | |_) |
 |_____\___/ \___/| .__/ 
                  |_|    
*****************************/

void loop() {

#ifdef WITH_CUSTOM_CAM

  unsigned long interCamCaptureTime;
  unsigned long nextCamCaptureTime;

#ifdef WAIT_FOR_SERIAL_INPUT
  //60s
  interCamCaptureTime=DEFAULT_INTER_SNAPSHOT_TIME*1000;
  nextCamCaptureTime=millis()+interCamCaptureTime;

  do {        
      boolean receivedCmd=false;
      uint8_t scmd[80];

      if (Serial.available()) {
          int sb=0;  
      
          while (Serial.available() && sb<80) {
            scmd[sb]=Serial.read();
            sb++;
            delay(50);
          }
          
          scmd[sb]='\0';
            
          Serial.print("Received from serial: ");

          rcv_data = scmd;
          rcv_data_len = sb;    
          receivedCmd=true;     
      }

      if (receivedCmd) {
          for (int f=0; f < rcv_data_len; f++) {
              Serial.print((char)rcv_data[f]);
            }
          
          int i=0;                        
          int cmdValue;
          long longCmdValue;

          // we use prefix '/@' to indicate a command string
          if ((char)rcv_data[i]=='/' && (char)rcv_data[i+1]=='@') {
          
              Serial.println(F("\nParsing command string"));
              
              i=2;
      
              // parse the received command
              // typical cmd is "C1#Q40#S1#" for instance
              while (i < rcv_data_len-1 && rcv_data_len<MAX_CMD_LENGTH) {
                                            
                  switch ((char)rcv_data[i]) {
                      // set the pkt size for binary mode, default is 100
                      // "Z50#"
                      case 'Z':
                      
                              i++;
                              cmdValue=getCmdValue(i);
                              // cannot set pkt size greater than MAX_PKT_SIZE
                              if (cmdValue > MAX_PKT_SIZE)
                                      cmdValue = MAX_PKT_SIZE;
                              // cannot set pkt size smaller than MAX_PKT_SIZE
                              if (cmdValue < MIN_PKT_SIZE)
                                      cmdValue = MIN_PKT_SIZE;
                              // set new pkt size        
                              set_mss(cmdValue); 
                              
                              Serial.print(F("Set MSS to "));
                              Serial.println(cmdValue);
                      break;      
                      
                      // set the quality factor, default is 50
                      // "Q40#"
                      case 'Q':
                      
                              i++;
                              cmdValue=getCmdValue(i);
                              // QualityFactor is 100 maximum
                              if (cmdValue > 100)
                                      cmdValue = 100;
                              // set minimum value to 5
                              if (cmdValue < 5)
                                      cmdValue = 5;
                              // set new QualityFactor        
                              set_quality_factor(cmdValue); 
                              
                              Serial.print(F("Set Q to "));
                              Serial.println(cmdValue);
                              
                              break;  

                      // set inter-frame time, in ms, default is 30s                                                                                                                                      
                      case 'F':

                              i++;
                              longCmdValue=getCmdValue(i);
                              // cannot set an inter snapshot time smaller than MIN_INTER_SNAPSHOT_TIME
                              if (longCmdValue < MIN_INTER_SNAPSHOT_TIME)
                                      longCmdValue = MIN_INTER_SNAPSHOT_TIME;
                              // set new inter snapshot time        
                              interCamCaptureTime=longCmdValue; 
                              
                              Serial.print(F("Set inter-snapshot time to "));
                              Serial.println(interCamCaptureTime);
                                      
                              break;
                  }
                  // go to next command if any.
                  i++;       
              }
          }
          else {
              Serial.println(F("\nHave not recognized a command prefix /@"));
          }                      
      }
      //avoid wrapping
      delay(1000);
      interCamCaptureTime -= 1000;    
  } while (interCamCaptureTime>0);
#else //WAIT_FOR_SERIAL_INPUT

#ifdef TEST_IN_PROGRESS
  //60s
  interCamCaptureTime=DEFAULT_INTER_SNAPSHOT_TIME*1000;
#else
  //60mins
  interCamCaptureTime=DEFAULT_INTER_SNAPSHOT_TIME*60*1000;  
#endif    

  nextCamCaptureTime=millis()+interCamCaptureTime;
#endif

  camera_fb_t *fb = NULL;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
      log_e("Camera capture failed");
  }

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);

  esp_camera_fb_return(fb);

  if (!converted) {
      log_e("BMP Conversion failed");
  }

  //here we pass buf as image buffer to our encoding procedure
  encode_image(buf, false);

  free(buf);

#ifdef MY_XIAO_ESP32S3_SENSE
  //XIAO ESP32S3 has inverted logic for the built-in led
  digitalWrite(LED_BUILTIN, LOW);  
  delay(200);                      
  digitalWrite(LED_BUILTIN, HIGH);   
  delay(200);
  digitalWrite(LED_BUILTIN, LOW);  
  delay(200);                      
  digitalWrite(LED_BUILTIN, HIGH);
  delay(200);   
#else
  digitalWrite(LED_BUILTIN, HIGH);  
  delay(200);                      
  digitalWrite(LED_BUILTIN, LOW);   
  delay(200);
  digitalWrite(LED_BUILTIN, HIGH);  
  delay(200);                      
  digitalWrite(LED_BUILTIN, LOW);
  delay(200); 
#endif

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);

  ///////////////////////////////////////////////////////////////////
  // LOW-POWER BLOCK - DO NOT EDIT
  ///////////////////////////////////////////////////////////////////

#if defined LOW_POWER_DEEP_SLEEP || defined LOW_POWER_LIGHT_SLEEP
  Serial.print("Switch to power saving mode\n");

  //CONFIGURATION_RETENTION=RETAIN_DATA_RAM on SX128X
  //parameter is ignored on SX127X
  LT.setSleep(CONFIGURATION_RETENTION);

  unsigned long now_millis=millis();

  Serial.println(now_millis);
  Serial.println(nextCamCaptureTime);
  
  unsigned long waiting_time;

  //how much do we still have to wait, in millisec?
  if (now_millis > nextCamCaptureTime) {
      // In case of wrapping
      Serial.print("Something wrong with sleep time, back to default\n");
#ifdef TEST_IN_PROGRESS
      //60s
      interCamCaptureTime=DEFAULT_INTER_SNAPSHOT_TIME*1000;
#else
      //60mins
      interCamCaptureTime=DEFAULT_INTER_SNAPSHOT_TIME*60*1000;  
#endif    
      nextCamCaptureTime=now_millis+interCamCaptureTime;
  }
 
  waiting_time = nextCamCaptureTime-now_millis;

  // When testing in deep sleep mode, we wait 30s to allow flashing a new code if necessary
  // otherwise, deep sleep disconnects the serial port and Arduino IDE cannot flash anymore
  if (bootCount == 0) {
      Serial.println("First start, delay of 30s for uploading program if necessary");
      delay(30000);
      waiting_time = nextCamCaptureTime-millis();
  }

  Serial.println(waiting_time);

  lowPower(waiting_time);
  
  // In deep sleep mode, this code will never happen
  Serial.print("Wake from power saving mode\n");
  LT.wake();      
#endif

#else
  // The original CameraWebServer example to test the camera
  // Do nothing. Everything is done in another task by the web server
  delay(10000);
#endif
}
